import React from "react";
import { Link } from "react-router-dom";
import "./style.scss";

function AboutUsPage() {
  return (
    <div className="aboutUs">
      <div className="container">
        <div className="aboutUs__links">
          <Link className="toHome" to={"/"}>
            Главная
          </Link>
          <Link className="toAboutUs" to={"/aboutUs"}>
            {" "}
            / О нас
          </Link>
        </div>
        <div className="aboutUs__content">
          <p className="aboutUs__content__text">
            Дорогие друзья, <br />С великой радостью и гордостью мы обращаемся к
            вам, нашим уважаемым пользователям, от лица нашего маркетплейса.{" "}
            <br /> Мы — команда, объединенная общей миссией сделать ваше
            онлайн-покупательское путешествие незабываемым, удобным и
            вдохновляющим. Наша цель — не просто предложить вам товары и услуги,
            а создать для вас пространство, где вы можете найти все, что вам
            нужно, и даже больше. <br /> Мы стремимся быть не просто местом для
            совершения покупок, но и центром ваших интересов, источником новых
            идей и вдохновения. Мы уверены в том, что каждый продукт и услуга на
            нашем маркетплейсе способны принести вам радость, удовлетворение и
            помочь вам воплотить в жизнь ваши мечты и амбиции. Мы всегда
            стремимся быть лучше, и поэтому мы постоянно работаем над улучшением
            нашей платформы, расширением ассортимента продукции, улучшением
            качества обслуживания и предоставлением вам новых возможностей.{" "}
            <br /> Вы, наши пользователи, — сердце и душа нашего маркетплейса.
            Мы ценим ваше доверие, поддержку и обратную связь. Вместе мы создаем
            уникальное сообщество, где каждый найдет что-то особенное для себя.
            Спасибо, что выбираете нас. Мы гордимся тем, что можем быть частью
            вашего путешествия. С любовью, Команда нашего маркетплейса
          </p>
        </div>
      </div>
    </div>
  );
}

export default AboutUsPage;
